In [1]:
import pandas as pd

In [2]:
data={
"a":[1,2,3,4],
"b":[4,5,6,7],
"C":["Mari","rahju","uack","queen"]
}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

   a  b      C
0  1  4   Mari
1  2  5  rahju
2  3  6   uack
3  4  7  queen

In [6]:
df.set_index('C')

       a  b
C
Mari   1  4
rahju  2  5
uack   3  6
queen  4  7

In [7]:
df.set_index('C',inplace=True)

In [8]:
df

       a  b
C
Mari   1  4
rahju  2  5
uack   3  6
queen  4  7

In [9]:
df.reset_index()

       C  a  b
0   Mari  1  4
1  rahju  2  5
2   uack  3  6
3  queen  4  7

In [10]:
df.reindex([1,3,2,0])

    a   b
C
1 NaN NaN
3 NaN NaN
2 NaN NaN
0 NaN NaN

In [11]:
df

       a  b
C
Mari   1  4
rahju  2  5
uack   3  6
queen  4  7

In [12]:
df.reset_index()

       C  a  b
0   Mari  1  4
1  rahju  2  5
2   uack  3  6
3  queen  4  7

In [13]:
for i in df.iterrows():
    print(i)

('Mari', a    1
b    4
Name: Mari, dtype: int64)
('rahju', a    2
b    5
Name: rahju, dtype: int64)
('uack', a    3
b    6
Name: uack, dtype: int64)
('queen', a    4
b    7
Name: queen, dtype: int64)

In [18]:
for i in df.iteritems():
    print(i)

('C', 0     Mari
1    rahju
2     uack
3    queen
Name: C, dtype: object)
('a', 0    1
1    2
2    3
3    4
Name: a, dtype: int64)
('b', 0    4
1    5
2    6
3    7
Name: b, dtype: int64)

In [16]:
df.reset_index(inplace=True)

In [22]:
df

       C  a  b
0   Mari  1  4
1  rahju  2  5
2   uack  3  6
3  queen  4  7

In [24]:
def test(x):
    return sum(x)

In [ ]:
df.apply(test, axis=0)

In [32]:
df2=df[df.dtypes[df.dtypes=="int64"].index]

In [33]:
df2

   a  b
0  1  4
1  2  5
2  3  6
3  4  7

In [34]:
df2.applymap(lambda x :x **2)

    a   b
0   1  16
1   4  25
2   9  36
3  16  49

In [37]:
df.sort_values('C')

       C  a  b
0   Mari  1  4
3  queen  4  7
1  rahju  2  5
2   uack  3  6

In [39]:
df.sort_index(ascending=False)

       C  a  b
3  queen  4  7
2   uack  3  6
1  rahju  2  5
0   Mari  1  4

In [42]:
df['cahleng']=df["C"].apply(lambda x : len(x))

In [43]:
df

       C  a  b  cahleng
0   Mari  1  4        4
1  rahju  2  5        5
2   uack  3  6        4
3  queen  4  7        5

In [47]:
t="thsius is mu mari"
len(t.split())

4

In [49]:
df['a'].median()

2.5

In [50]:
df.describe()

              a         b  cahleng
count  4.000000  4.000000  4.00000
mean   2.500000  5.500000  4.50000
std    1.290994  1.290994  0.57735
min    1.000000  4.000000  4.00000
25%    1.750000  4.750000  4.00000
50%    2.500000  5.500000  4.50000
75%    3.250000  6.250000  5.00000
max    4.000000  7.000000  5.00000

In [51]:
df['a'].std()

1.2909944487358056

In [52]:
df['a'].min()

1

In [53]:
df['a'].max()

4

In [54]:
df['a'].var()

1.6666666666666667

In [57]:
## window functioN
data4={
"a":[1,2,3,4,5,6,7,8,9]  
}

In [58]:
df4=pd.DataFrame(data4)

In [59]:
df4

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [60]:
df4.rolling(window=1).mean()

     a
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0
7  8.0
8  9.0

In [61]:
df4.rolling(window=2).mean()

     a
0  NaN
1  1.5
2  2.5
3  3.5
4  4.5
5  5.5
6  6.5
7  7.5
8  8.5

In [62]:
df4

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [63]:
df4.cumsum()

    a
0   1
1   3
2   6
3  10
4  15
5  21
6  28
7  36
8  45

#### date functionality

In [64]:
dateda=pd.date_range(start="2022-03-01", end="2022-03-31")

In [65]:
dateda

DatetimeIndex(['2022-03-01', '2022-03-02', '2022-03-03', '2022-03-04',
               '2022-03-05', '2022-03-06', '2022-03-07', '2022-03-08',
               '2022-03-09', '2022-03-10', '2022-03-11', '2022-03-12',
               '2022-03-13', '2022-03-14', '2022-03-15', '2022-03-16',
               '2022-03-17', '2022-03-18', '2022-03-19', '2022-03-20',
               '2022-03-21', '2022-03-22', '2022-03-23', '2022-03-24',
               '2022-03-25', '2022-03-26', '2022-03-27', '2022-03-28',
               '2022-03-29', '2022-03-30', '2022-03-31'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
dateda.dtypes

In [70]:
df8=pd.DataFrame({"date":["2022-03-01"]})

In [71]:
df8

         date
0  2022-03-01

In [72]:
df8.dtypes

date    object
dtype: object

In [73]:
df8['updatedate']=pd.to_datetime(df8['date'])

In [75]:
df8.dtypes

date                  object
updatedate    datetime64[ns]
dtype: object

In [77]:
df8['year']=df8['updatedate'].dt.year

In [78]:
df8

         date updatedate  year
0  2022-03-01 2022-03-01  2022

In [79]:
df8['month']=df8['updatedate'].dt.month

In [80]:
df8

         date updatedate  year  month
0  2022-03-01 2022-03-01  2022      3

In [81]:
df8['day']=df8['updatedate'].dt.day

In [82]:
df8

         date updatedate  year  month  day
0  2022-03-01 2022-03-01  2022      3    1

#### Time Delta

In [87]:
time=pd.Timedelta(days=1,hours=5,minutes=50)

In [88]:
dat=pd.to_datetime("2022-03-01")

In [89]:
dat+time

Timestamp('2022-03-02 05:50:00')

In [90]:
df

       C  a  b  cahleng
0   Mari  1  4        4
1  rahju  2  5        5
2   uack  3  6        4
3  queen  4  7        5